content/post/probability-distribution.md
+++
title = "Basics of Probability and Random Variable"
date = 2019-05-13
tags = ["probability distribution", "random variable"]
categories = ["statistics", "probability"]
draft = false
author = "Peter Lo"
+++

Roughly speaking, probability describes how likely a certain event
takes place, and probability distribution refers to how likely a
random variable takes different values. In this post, we look at some
examples to get an intuitive idea of probability, sample space,
events, random variable and probability space.


## Probability {#probability}

_Probability_ is used to quantitatively describe how _likely_ an
_event_ would occur. A _probability_ is a number between (inclusive) 0
and 1, where a larger value means the event is more _likely_.


### Frequentist and Bayesian interpretation {#frequentist-and-bayesian-interpretation}

There are two slightly different interpretations of probability:
_frequentist_ and _Bayesian_ interpretation.

> Frequentist interpretation:
>
> The probability of an event is the limiting _relative frequency_ that
> the event occurs if the number of trials approaches infinity.

For example, under the frequentist interpretation, if we say the
probability of coin toss giving a tail is 0.6, what is meant is that
_if_ we flip the coin a _huge_ number of times, 60% of the flips would
result in a tail.

Note that this interpretation requires that it is at least conceivable
to repeat the trial to calculate the relative frequency that the event
occurs. For example, if we were to make sens of the "probability that
the moon is made of cheese", we might need to imagine the moon gets
repeatedly created, and calculate the proportion where the moon is
made of cheese.

On the other hand, the Bayesian interpretation of probability is more
liberal.

> Bayesian interpretation:
>
> The probability of an event is the _degree of belief_ that it occurs.

Under the Bayesian interpretation, we can speak of _subjective_
probability, in addition to /objective probability, and there is no
difficulty of making sense of the "probability that the moon is made
of cheese". Also, by the _Law of large number_, the relative frequency
of an event will tend to the objective probability if the number of
trials tends to infinity.

In practice, it does not matter much which interpretation you
subscribe to, because the formulas related to probability are mostly
the same (sometimes frequentists refuse to give interpretation to some
formulas in some cases). The difference is more philosophical than
practical.


## Sample space and events {#sample-space-and-events}

Whether we use frequentist or Bayesian interpretation of probability,
one key ingredient is _event_. For an event to make sense, it suffices
to have a clear criteria to determine whether an event has
occurred. For example, if we throw a dice, we may consider the
following events:

-   event A: the number is 2
-   event B: the number is even
-   event C: the number is odd
-   event D: the number is less than 3
-   event E: the number is both even and odd

We note that the above events are related:

-   Since 2 is even and is less than 3, event A implies both event B and event D.
-   Event C and D have some overlap (e.g. the number 1 is both odd and less than 3), but neither one implies the other.
-   Also, an integer is either even or odd, but not both, so event B and event C are _exclusive_, and together they are _exhaustive_.
-   Moreover, event E is an impossible event.

When modeling a situation, we can formally define a _sample space_,
which could be regarded as the set of atomic events, and subsets of
the sample space are the events. Note that we may model the same
situation with different sample spaces, but some sample space may be
more intuitive than others.

Events can give rise to other events, for example:

-   event E above is "event B _and_ event C";
-   event B is "_not_ event C" since an integer is either even or odd;
-   event D is "the number is less than 3", which is the same as "the number is 1 _or_ the number is 2" in this example.

In general:

-   the whole sample space (the set of all atomic events) is always an event, this is an event that is sure to happen
-   if A is an event, then "not A" is also an event
-   if A1, A2, ... are (finite or _countably infinite_ many) events, then "A1 _or_ A2 _or_ ..." and "A1 _and_ A2 _and_ ..." are also events


### Example: Dice throwing {#example-dice-throwing}

For instance, in the dice throwing example, we could define the sample
space as {1, 2, 3, 4, 5, 6}, then the 4 events above are respectively:

-   event A (the number is 2): {2}
-   event B (the number is even): {2, 4, 6}
-   event C (the number is odd): {1, 3, 5}
-   event D (the number is less than 3): {1, 2}
-   event E (the number is both even and odd): {}


### Example: Coin tossing {#example-coin-tossing}

As another example, for tossing a coin once, we may define the sample
space as {H, T} for "Head" and "Tail". Note that the sample space can
consist of any object, not just numbers. Also note that by defining
the sample space as {H, T}, we are implicitly excluding the
possibility that the coin may land on its edge, and therefore giving
neither a "Head" nor a "Tail".


### Example: Multiple coin tossings {#example-multiple-coin-tossings}

We may also model multiple coin tossings. E.g. if we model 3 coin
tossings, we may define the sample space as {(H,H,H), (H,H,T),
(H,T,H), (H,T,T), (T,H,H), (T,H,T), (T,T,H), (T,T,T)}, then we may
consider events such as:

-   "two heads out of 3 tosses": {(H,H,T), (H,T,H), (T,H,H)}
-   "the first two tossings give the same results": {(H,H,H), (H,H,T), (T,T,H), (T,T,T)}

We can even model infinitely many coin tossings, e.g. by defining the
sample space as \\(\\{(x\_1, x\_2, \ldots): x\_i \in \\{H,T\\}\\}\\). Then we may
consider events such as:

-   "the first toss is head": \\(\\{(H,x\_2,x\_3,\ldots): x\_i \in \\{H,T\\}\\}\\)
-   "it takes 3 tosses to get the first head": \\(\\{(T,T,H,x\_4,x\_5,\ldots): x\_i \in \\{H,T\\}\\}\\)
-   "head and tail appears alternately": \\(\\{(H,T,H,T,\ldots), (T,H,T,H,\ldots)\\}\\)


### Example: Time until a newly manufactured light bulb fails {#example-time-until-a-newly-manufactured-light-bulb-fails}

For modeling time until some events occur, we may define the sample
space as \\(\\{x: x>0\\}\\). For example, the time (in hours) until a newly
manufactured light bulb fails. Although we can measure "time" only up
to a certain precision, "time" is conceptually _continuous_, and
therefore often modeled as a continuous real value. We may then
consider events such as:

-   "the light bulb will not fail in the first 10,000 hours": \\(\\{x: x>10 000\\}\\)
-   "the light bulb will not last more than 100,000 hours": \\(\\{x: 0 < x \leq 100 000\\}\\)

On the other hand, in some cases, modeling the time as integers may be
sufficient, e.g. when we want to count the number of days of a patient
staying in the hospital, but do not want to consider fractional number
of days. In such case, we may take the sample space as {0, 1, 2, ...}.


### Example: Height and weight {#example-height-and-weight}

For height and weight of a person, similar to time, although we can
measure height and weight only up to a certain precision, they are
conceptually continuous, and therefore often modeled as continuous
real values. We may define the sample space as \\(\\{(h,w): h>0, w>0\\}\\)
(suppose we measure height h in "m", and weight w in "kg"). We may then
consider events such as:

-   "the height is below 1.6m": \\(\\{(h,w): 0 < h < 1.6, w>0\\}\\)
-   "the BMI is above 20, but below 24, where BMI is the weight in kg divided by the square of the height in m": \\(\\{(h,w): 20 < \frac{w}{h^2} < 24\\}\\)
