org_content/post/probability-distribution.org
* Probability space

A /sample space/, the /events/, together with the probabilities of the
events, is called a /probability space/.

As we see from the examples above, some events in a sample space may
be related, it is then unsurprising that their probabilities are also
related. Probabilities are very similar to /measure/ such as
area.

Suppose there is a region (e.g. a square) with area 1.
- Then intuitively, any smaller regions inside would have area less than or equal to 1.
- In fact, if a region A is entirely within another region B, the area of A is not larger than the area of B.
- Also, the total area of two non-overlapping regions is the sum of the areas of the two regions.

In a probability space:
- the probability of the whole sample space is 1.
- And if events A and B are exclusive of each other (have no overlaps, i.e. no common atomic events), then the probability of "A or B" is the sum of probability of A and probability of B.
- In fact, this summation rule works for countably infinitely many exclusive events.
- If event C is a subset of event D (event C implies event D, i.e. every atomic event in C is also in D), then the probability of C is less than or equal to the probability of D.
- Note that even if D contains all atomic events of C, and D has some other atomic events not in C, the probability of D may still be the same as the probability of C, because the extra events may have probability zero.
- Since any event E and "not E" are exclusive, and "E or (not E)" is the whole sample space, "probability of E" plus the "probability of not E" is equal to the probability of the sample space, which is 1. Consequently, "probability of not E" is 1 minus the "probability of E".
- The probability is often denoted as $P(.)$, e.g. $P(\text{event B}) = P(\{2, 4, 6\})$ denotes the probability of event B in the dice throwing example above.

If the sample space is finite or countably infinite, the events are
usually all the possible subsets of the sample space, and by the
summation rule above, if we know the probabilities of each atomic
event, we can get the probability of any event by summation. For
example, we have $P(\{2, 4, 6\}) = P(\{2\}) + P(\{4\}) + P(\{6\})$.

But if the sample space is uncountably infinite, the events often have
uncountably infinitely many elements, we cannot simply use the
summation rule to get the probability of an event from the sum of the
atomic events, because the rule works only for a sum of countably many
terms. We would not go into further details of such technical issues,
but it should be emphasized that the above rules still work, and we
can nevertheless define a consistent probability measure on all the
events such as $\{x: x> 10 000\}$ and $\{x: 500 \leq x < 2000\}$.

* Random variable
From a sample space, there may be many quantities that may be of
interest. In the above examples, we have quantities such as

- "number of heads out of 3 tosses"
- "number of tosses to get the first head"
- BMI, which is calculated from the weight and height

These are examples of /random variable/. Note that the values of these
quantities can all be determined by knowing which atomic event has
occurred. More formally, a /random variable/ is a /function/ from the
atomic events of a sample space to a value (which could be any object,
not just numbers). Let's look at some examples of random variables
that can be defined on the above sample spaces:

** Example: Dice throwing

| Atomic event |  1 |   2 | 3 |  4 |    5 | 6 |
|--------------+----+-----+---+----+------+---|
| $X_1$        |  1 |   2 | 3 |  4 |    5 | 6 |
| even         |  0 |   1 | 0 |  1 |    0 | 1 |
| odd          |  1 |   0 | 1 |  0 |    1 | 0 |
| $X_2$        |  6 |   5 | 4 |  3 |    2 | 1 |
| $X_3$        |  A |   A | B |  B |    C | C |
| $X_4$        | 20 | 712 | 4 | -8 | 6466 | 0 |

- Note that we may define multiple random variables on the same sample space, and the relationship between the atomic event and the value of the random variable can be arbitrarily complex, as long as for each atomic event, the random variable takes only a single value.
- $X_1$ is simply the atomic event itself.
- "even" and "odd" takes only the values 0 and 1, and are usually called /indicator/ variables, which assume the value 1 for a particular event of interest, and 0 otherwise.
- $X_1$ and $X_2$ both takes the values 1 to 6, but on different atomic events.
- $X_1$ and $X_2$ are also related in that $X_1 + X_2 = 7$ in any case.
- $X_3$ is an example of random variable that is not numeric, but here it takes the values "A", "B" or "C".
- For $X_4$, you need not try to guess a succinct formula between the atomic event and its value, because I just hit the number pad randomly to get these numbers.
- Nevertheless, $X_4$ is a perfectly valid random variable defined on the above sample space.

** Example: Coin tossing

| Atomic event | H | T |
|--------------+---+---|
| $y_1$        | 1 | 0 |
| $Y_2$        | 0 | 1 |
| $Y_3$        | 1 | 1 |

- $Y_1$ is simply an indicator for "head" and $Y_2$ is an indicator for "tail".
- Note that $Y_3$ takes the same value 1 on the different atomic events, so it is a /constant/.
- It may seem strange that a constant would be called a /random variable/, because it is not at all /random/, and does not /vary/. But it satisfies the definition of /random variable/, though sometimes a constant may be called a degenerate random variable.

** Example: Multiple coin tossing

We may define a random variable $Z_1$ as the number of tosses until
the first "head" (including the toss giving the first "head"), more
precisely, $Z_1 = \min \{t: x_t = H\}$. Note that $Z_1$ can
potentially take any integer greater than 0. For example, $Z_1 = 1$ on
all of $\{(H,\ldots)\}$, and $Z_1 = 2$ on all of $\{(T,H,\ldots)\}$.

We may define another random variable $Z_2$ as the number of heads in
the first 100 tosses, then the possible values of $Z_2$ are integers
from 0 to 100. Note that even though each element of the sample space
is infinitely long (representing infinitely many tosses), the value of
$Z_2$ could be determined from the first 100 tosses. If we only want
to model $Z_2$, we may as well use a (finite but very large) sample
space such as $\{(x_1, x_2, \ldots, x_{100}): x_i \in \{H,T\}\}$.

** Example: Time until a newly manufactured light bulb fails

In this sample space $\{x: x>0\}$, we may define a random variable
$W_1$ as the time (in hours) until a newly manufactured light bulb
fails, which would simply take the value of the atomic event.

We may also define another random variable $W_2$ as a discretized
version of $W_1$ by taking only the integer part, i.e. $W_2 = 0$ if $0
\leq W_1 < 1$, and $W_2 = 1$ if $1 \leq W_1 < 2$ and so on. In
general, we may discretize a continuous random variable by whatever
break points we like.

We may define a vector valued random variable $W_3 = (t, d)$, where $d
= 0$ if $x > 10000$, and $d = 1$ if $x \leq 10000$; $t = min(x,
10000)$. Note that the two elements of the vector are related.

** Example: Height and weight

| Atomic event | $(h,w)$              |
|--------------+----------------------|
| $V_1$        | h                    |
| $V_2$        | w                    |
| $V_3$        | $\frac{w}{h^2}$      |
| $V_4$        | $(w, \frac{w}{h^2})$ |

- Here $V_1$ is simply the height, and $V_2$ is the weight, and $V_3$ is the BMI.
- Note that the value of $V_4$ is a vector of the weight and the BMI.
- In general, the value of a random variable can be even more complicated objects.

