content/post/probability-distribution.md


## Probability space {#probability-space}

A _sample space_, the _events_, together with the probabilities of the
events, is called a _probability space_.

As we see from the examples above, some events in a sample space may
be related, it is then unsurprising that their probabilities are also
related. Probabilities are very similar to _measure_ such as
area.

Suppose there is a region (e.g. a square) with area 1.

-   Then intuitively, any smaller regions inside would have area less than or equal to 1.
-   In fact, if a region A is entirely within another region B, the area of A is not larger than the area of B.
-   Also, the total area of two non-overlapping regions is the sum of the areas of the two regions.

In a probability space:

-   the probability of the whole sample space is 1.
-   And if events A and B are exclusive of each other (have no overlaps, i.e. no common atomic events), then the probability of "A or B" is the sum of probability of A and probability of B.
-   In fact, this summation rule works for countably infinitely many exclusive events.
-   If event C is a subset of event D (event C implies event D, i.e. every atomic event in C is also in D), then the probability of C is less than or equal to the probability of D.
-   Note that even if D contains all atomic events of C, and D has some other atomic events not in C, the probability of D may still be the same as the probability of C, because the extra events may have probability zero.
-   Since any event E and "not E" are exclusive, and "E or (not E)" is the whole sample space, "probability of E" plus the "probability of not E" is equal to the probability of the sample space, which is 1. Consequently, "probability of not E" is 1 minus the "probability of E".
-   The probability is often denoted as \\(P(.)\\), e.g. \\(P(\text{event B}) = P(\\{2, 4, 6\\})\\) denotes the probability of event B in the dice throwing example above.

If the sample space is finite or countably infinite, the events are
usually all the possible subsets of the sample space, and by the
summation rule above, if we know the probabilities of each atomic
event, we can get the probability of any event by summation. For
example, we have \\(P(\\{2, 4, 6\\}) = P(\\{2\\}) + P(\\{4\\}) + P(\\{6\\})\\).

But if the sample space is uncountably infinite, the events often have
uncountably infinitely many elements, we cannot simply use the
summation rule to get the probability of an event from the sum of the
atomic events, because the rule works only for a sum of countably many
terms. We would not go into further details of such technical issues,
but it should be emphasized that the above rules still work, and we
can nevertheless define a consistent probability measure on all the
events such as \\(\\{x: x> 10 000\\}\\) and \\(\\{x: 500 \leq x < 2000\\}\\).


## Random variable {#random-variable}

From a sample space, there may be many quantities that may be of
interest. In the above examples, we have quantities such as

-   "number of heads out of 3 tosses"
-   "number of tosses to get the first head"
-   BMI, which is calculated from the weight and height

These are examples of _random variable_. Note that the values of these
quantities can all be determined by knowing which atomic event has
occurred. More formally, a _random variable_ is a _function_ from the
atomic events of a sample space to a value (which could be any object,
not just numbers). Let's look at some examples of random variables
that can be defined on the above sample spaces:


### Example: Dice throwing {#example-dice-throwing}

| Atomic event | 1  | 2   | 3 | 4  | 5    | 6 |
|--------------|----|-----|---|----|------|---|
| \\(X\_1\\)   | 1  | 2   | 3 | 4  | 5    | 6 |
| even         | 0  | 1   | 0 | 1  | 0    | 1 |
| odd          | 1  | 0   | 1 | 0  | 1    | 0 |
| \\(X\_2\\)   | 6  | 5   | 4 | 3  | 2    | 1 |
| \\(X\_3\\)   | A  | A   | B | B  | C    | C |
| \\(X\_4\\)   | 20 | 712 | 4 | -8 | 6466 | 0 |

-   Note that we may define multiple random variables on the same sample space, and the relationship between the atomic event and the value of the random variable can be arbitrarily complex, as long as for each atomic event, the random variable takes only a single value.
-   \\(X\_1\\) is simply the atomic event itself.
-   "even" and "odd" takes only the values 0 and 1, and are usually called _indicator_ variables, which assume the value 1 for a particular event of interest, and 0 otherwise.
-   \\(X\_1\\) and \\(X\_2\\) both takes the values 1 to 6, but on different atomic events.
-   \\(X\_1\\) and \\(X\_2\\) are also related in that \\(X\_1 + X\_2 = 7\\) in any case.
-   \\(X\_3\\) is an example of random variable that is not numeric, but here it takes the values "A", "B" or "C".
-   For \\(X\_4\\), you need not try to guess a succinct formula between the atomic event and its value, because I just hit the number pad randomly to get these numbers.
-   Nevertheless, \\(X\_4\\) is a perfectly valid random variable defined on the above sample space.


### Example: Coin tossing {#example-coin-tossing}

| Atomic event | H | T |
|--------------|---|---|
| \\(y\_1\\)   | 1 | 0 |
| \\(Y\_2\\)   | 0 | 1 |
| \\(Y\_3\\)   | 1 | 1 |

-   \\(Y\_1\\) is simply an indicator for "head" and \\(Y\_2\\) is an indicator for "tail".
-   Note that \\(Y\_3\\) takes the same value 1 on the different atomic events, so it is a _constant_.
-   It may seem strange that a constant would be called a _random variable_, because it is not at all _random_, and does not _vary_. But it satisfies the definition of _random variable_, though sometimes a constant may be called a degenerate random variable.


### Example: Multiple coin tossing {#example-multiple-coin-tossing}

We may define a random variable \\(Z\_1\\) as the number of tosses until
the first "head" (including the toss giving the first "head"), more
precisely, \\(Z\_1 = \min \\{t: x\_t = H\\}\\). Note that \\(Z\_1\\) can
potentially take any integer greater than 0. For example, \\(Z\_1 = 1\\) on
all of \\(\\{(H,\ldots)\\}\\), and \\(Z\_1 = 2\\) on all of \\(\\{(T,H,\ldots)\\}\\).

We may define another random variable \\(Z\_2\\) as the number of heads in
the first 100 tosses, then the possible values of \\(Z\_2\\) are integers
from 0 to 100. Note that even though each element of the sample space
is infinitely long (representing infinitely many tosses), the value of
\\(Z\_2\\) could be determined from the first 100 tosses. If we only want
to model \\(Z\_2\\), we may as well use a (finite but very large) sample
space such as \\(\\{(x\_1, x\_2, \ldots, x\_{100}): x\_i \in \\{H,T\\}\\}\\).


### Example: Time until a newly manufactured light bulb fails {#example-time-until-a-newly-manufactured-light-bulb-fails}

In this sample space \\(\\{x: x>0\\}\\), we may define a random variable
\\(W\_1\\) as the time (in hours) until a newly manufactured light bulb
fails, which would simply take the value of the atomic event.

We may also define another random variable \\(W\_2\\) as a discretized
version of \\(W\_1\\) by taking only the integer part, i.e. \\(W\_2 = 0\\) if \\(0
\leq W\_1 < 1\\), and \\(W\_2 = 1\\) if \\(1 \leq W\_1 < 2\\) and so on. In
general, we may discretize a continuous random variable by whatever
break points we like.

We may define a vector valued random variable \\(W\_3 = (t, d)\\), where \\(d
= 0\\) if \\(x > 10000\\), and \\(d = 1\\) if \\(x \leq 10000\\); \\(t = min(x,
10000)\\). Note that the two elements of the vector are related.


### Example: Height and weight {#example-height-and-weight}

| Atomic event | \\((h,w)\\)              |
|--------------|--------------------------|
| \\(V\_1\\)   | h                        |
| \\(V\_2\\)   | w                        |
| \\(V\_3\\)   | \\(\frac{w}{h^2}\\)      |
| \\(V\_4\\)   | \\((w, \frac{w}{h^2})\\) |

-   Here \\(V\_1\\) is simply the height, and \\(V\_2\\) is the weight, and \\(V\_3\\) is the BMI.
-   Note that the value of \\(V\_4\\) is a vector of the weight and the BMI.
-   In general, the value of a random variable can be even more complicated objects.
