org_content/post/probability-distribution.org
** Distribution of Random Variable

Loosely speaking, the distribution of a random variable refers to how
likely (i.e. the probability) it would take various values or ranges
of values.

Let's consider the dice throwing example. What is the probability that
the random variable "even" is 1, i.e. what is $P(\text{even} = 1)$? We
see that $\text{even} = 1$ exactly when the atomic events are either
2, 4 or 6, intuitively, $P(\text{even} = 1) = P(\{2, 4, 6\})$, which
is equal to $P(\{2\}) + P(\{4\}) + P(\{6\})$.

As another example, what is the probability that $X_3$ is equal to
"B", i.e. what is $P(X_3 = \text{B})$? We see that $X_3 = \text{B}$
exactly when the atomic event is either 3 or 4, so $P(X_3 = \text{B})
= P(\{3, 4\})$, which is equal to $P(\{3\}) + P(\{4\})$.

We can also find the probability that a random variable takes a range
of values. For example, to find $P(X_2 \geq 4)$, we first determine
that $X_2 \geq 4$ exactly when the atomic event is either 1, 2 or 3,
so $P(X_2 \geq 4) = P(\{1, 2, 3\})$, which is equal to $P(\{1\}) +
P(\{2\}) + P(\{3\})$.

For continuous random variables, the process of determining the
probability is similar. For the height and weight example, to find
$P(40 \leq V_2 \leq 60)$, we find the subset of the sample space for
which $40 \leq V_2 \leq 60$, i.e. $\{(h, w): 40 \leq V_2 \leq 60\} =
\{(h, w): 40 \leq w \leq 60, h > 0\}$. So $P(40 \leq V_2 \leq 60) =
P(\{(h, w): 40 \leq w \leq 60, h > 0\})$.

As another example, $P(20 \leq V_3 \leq 24) = P(\{(h, w): 20 \leq V_3
\leq 24\})$, which is equal to $P(\{(h, w): 20 \leq \frac{w}{h^2} \leq
24\})$, although it is not easy to visualize this set here.

In general, since the atomic event determines the value of a random
variable, in order to find the probability that the random variable
takes a value or a range of values, we first determine the set of
atomic events that give rise to these values, then determine
probability of this set of atomic events, which would be well-defined
exactly when this set is also an event. Technically, we would require
the random variable to be /measurable/ with respect to the probability
space, i.e. the sets of atomic events corresponding to various values
of the random variable are events, but we would not go into details.

We see that the distribution of a random variable is induced from the
underlying probability space, but if we are focusing only on one
random variable, we often only describe the probability distribution
of the random variable, without mentioning the underlying sample
space. For example, for the $X_3$ in the dice throwing example, since
it can only take the values "A", "B" or "C", when only looking at the
value of $X_3$, we can know which subset of atomic events has
occurred, but cannot pinpoint exactly which atomic event has
occurred. For instance, knowing that $X_3 = \text{A}$, we only know
that the event is $\{1, 2\}$, but cannot pinpoint whether the event is
1 or 2. Therefore, we may summarize the distribution of $X_3$ by
specifying only $P(X_3 = \text{A})$, $P(X_3 = \text{B})$ and $P(X_3 =
\text{C})$. We would look at more examples in the next post.

* Summary

In this post, we have looked at the following concepts:
- probability: either the degree of belief of an event, or the limiting relative frequency of an event when the number of trials approaches infinity.
- sample space: the set of atomic events.
- event: subset of the sample space.
- probability space: a sample space, the events, and a probability measure on the events.
- random variable: a function from the sample space to a value.

In the next post, we would look at more examples of distributions of
discrete and continuous random variables, and the parametric way of
specifying distributions.
